import 'package:flutter/material.dart';
String term = """歡迎使用Ezcaring App（以下稱App），本網站由合錦科技股份有限公司經營，為了讓您能夠安心使用App的各項服務與資訊，特此向您說明App的隱私權保護即使用條款政策，以保障您的權益，請您詳閱下列內容：
一、隱私權保護政策的適用範圍
隱私權保護政策內容，包括App如何處理在您使用App服務時收集到的個人識別資料。隱私權保護政策不適用於本App以外的相關連結外部網頁，也不適用於非本App所委託或參與管理的人員。
二、個人資料的蒐集、處理及利用方式
App將向使用者（照護者或被照護者）蒐集被照護者所產生的生理資訊, 若您非被照護者本人，請確認您取得被照護者的同意。同時，App也會蒐集使用者所輸入的包含被照護者以及緊急聯絡人與照護者的以下個人識別資料。若您拒絕提供將無法提供您使用App相關服務：
當使用者登入使用App所提供之各項服務時，根據本App提供服務性質不同，我們會請您提供個人資訊，包括：帳號、密碼、電話、出生年月日、國籍、被照護者疾病史及其他相關必要、真實之資料。若已提供，表示您同意本App蒐集、處理、利用您所輸入之個人資料。
於一般連線時，伺服器會自行記錄相關行徑，包括您使用連線設備的IP位址、使用時間、使用的作ㄧ業系統、瀏覽及點選資料記錄等，做為我們增進App服務的參考依據，此記錄為內部應用，絕不對外公佈。
處理及使用範圍：在App所提供之功能服務時，於該特定目的範圍內處理及利用使用者的個人資料。
處理及使用方式：使用者個人資料蒐集與處理，將用於APP的會員管理檢索查詢等功能、資料統計外，也將利用於辨識個人身份、統計數據研究與公布、或宣傳廣告或行銷等，其相關利用方式如下：
為提供精確的服務，我們會將蒐集的資料內容進行統計與分析，分析結果之統計數據或說明文字呈現，除供內部研究外，我們會視需要公佈統計數據及說明文字，但不涉及特定個人之資料。
針對民調、活動、留言版等意見，或其他服務事項，透過電子郵件、郵件、電話等聯繫您或提供各種服務資訊，或對於您透過電子郵件、郵件、傳真、電話等連絡方式提出詢問後進行回覆。
其他前述業務附隨的事項。
利用期間：至您要求停止使用或App停止提供服務之日為止。
利用地區：除蒐集之目的涉及國際業務或活動外，本公司僅於中華民國領域內利用使用者的個人資料。
不同意之權益影響：若使用者不同意提供個人資料，本公司將無法為使用者提供特定目的之相關服務。
除法律另有規定外，您對於個人資料的法定權利：
查詢或請求閱覽。
請求製給複製本。
請求補充或更正。
請求停止蒐集、處理或利用。
請求刪除。
非經使用者書面同意，本App不會將個人資料用於其他用途。
未成年人使用App時，若同意本網站蒐集、處理、及利用其個人資訊時，應在法定代理人或監護人的同意下為之。法定代理人或監護人得隨時請求本公司停止特定帳號及其相關之個人資料之蒐集、處理及利用行為。但純獲法律上利益，或依其年齡及身份、日常生活所必需者，不在此限。
由於App無法知悉所蒐集到的個人資料是否屬未成年人所有，或是有無得到其法定代理人的同意。如果對本網站可能有未經法定代理人同意或未有其他法律依據而蒐集未成年人個人資料之疑慮，請以此E-Mail  連絡我們，我們將立刻採取妥善措施進行調查及改正。
三、資料之保護
本App主機均設有防火牆、防毒系統等相關的各項資訊安全設備及必要的安全防護措施，加以保護網站及您的個人資料採用嚴格的保護措施，只由經過授權的人員才能接觸您的個人資料，相關處理人員皆簽有保密合約，如有違反保密義務者，將會受到相關的法律處分。
如因業務需要有必要委託其他單位提供服務時，本App亦會嚴格要求其遵守保密義務，並且採取必要檢查程序以確定其將確實遵守。
四、網站對外的相關連結
本App的網頁提供其他網站的網路連結，您也可經由本App所提供的連結，點選進入其他網站。但該連結網站不適用本App的隱私權保護政策，您必須參考該連結網站中的隱私權保護政策。
五、與第三人共用個人資料之政策
使用者同意合錦科技股份有限公司合作之醫療保健機構暨其醫師、醫療人員得共享、傳輸、存取、蒐集、處理及利用您本人於本App上所填載之個人資料及分析數據資訊，作為研究目的之使用，除此之外，本App絕不會提供、交換、出租或出售任何您的個人資料給其他個人、團體、私人企業或公務機關，但有法律依據或合約義務者，不在此限。前項但書之情形包括不限於：
經由您書面同意。
法律明文規定。
為免除您生命、身體、自由或財產上之危險。
與公務機關或學術研究機構合作，基於公共利益為統計或學術研究而有必要，且資料經過提供者處理或蒐集著依其揭露方式無從識別特定之當事人。
當您在App裡的行為，違反服務條款或可能損害或妨礙App與其他使用者權益或導致任何人遭受損害時，經App管理單位研析揭露您的個人資料是為了辨識、聯絡或採取法律行動所必要者。
您同意在本App服務範圍內，本App委託廠商得協助蒐集、處理或利用您的個人資料，受託廠商應盡善良管理人責任。
六、隱私權保護政策之修正
本App隱私權保護政策將因應需求隨時進行修正。
                          """;
String notice = """提醒：  

燈光亮度影響偵測範圍與結果，若因操作不當、斷電等非本公司可控因素導致問題，本公司概不負責。詳見說明書。
""";

String warning = """警告: 

靜音提醒風險

提醒：

請注意音量大小調整，確保被照護者能清楚接收到播放訊息，若因使用者設定操作不當、斷電及天災或合作廠商資訊提供異常等非可歸責於本公司之因素，係非本公司可控制範圍，造成通報疏失，本公司不負擔任何責任。詳細使用說明請參閱產品說明書。  
""";
String baogu = '''保固政策
（以下簡稱保固服務）
本產品保固之相關說明，係包括重要之消費者權利、義務、限制和例外情形。 
本產品保固服務僅適用於合錦科技股份有限公司（以下稱“合錦科技”、“本公司”、“我們”）之產品，包含電子類及配件等。前開提及電子及配件類產品之定義如下：
(a) 電子類：由直流電趨動之設備，包含經由插頭或電池供電等
(b) 配件類：非一次使用之非電子類之實體商品
(c) 耗材類：一次性使用之實體商品
爲了確保顧客使用器材之安全性，我們的器材特殊性產品，只有在產品的外層包裝封膜維持完整的情況下，才會接受產品退貨，一旦外層封膜經拆封，恕不接受退換貨。
合錦科技之保固服務及專屬客戶服務僅適用於自官方自有、授權或合作夥伴線上平台或實體通路購買之產品，並得將硬體產品之換貨及維修服務限制於官方或授權經銷商最初銷售該產品之國家/地區內提供。
任何非經（2.）列示之通路官方或授權之通路所購買的產品則無法享有本公司保固服務。此外，於使用保固服務時，需提供產品的購買證明（或可追溯的訂單號碼）。 
保固期 1 年內，EZcaring販售之電子類產品，在正常和正確使用的情況下，因材料上或製造上之瑕疵而導致故障，合錦科技將在收到購買或到貨日期之證明後，提供免費維修或更換的服務。
如果電子類產品之硬體出現瑕疵，並在保固期間內收到消費者書面申請時，合錦科技將在法律允許的範圍內採用下列措施： 
(a) 使用全新零件或整新零件免費修理或更換硬體 
(b) 以全新或整新後的產品做更換，該產品應與原始產品具有同等之功能
自到貨日起在30日內，EZcaring 販售之配件類商品，如到貨時發現材類或製造瑕疪，經由合錦科技客服協助判定後為瑕疪品者，本公司將提供適當之退換貨服務。
當您的 EZcaring 電子類產品於保固服務範圍內被更換（包含機器本體或經合錦科技判定需更換之損壞配件，該產品仍於原始保固服務剩餘期間，仍享有不可轉讓之保固服務。
購買者於官方或授權經銷商最初銷售該產品之國家/地區內 (2.) 購買之實體商品，合錦科技將提供本保固服務授權維修（僅限電子類產品）或更換（含非耗材之配件），於該期間之運費由本公司承擔（僅限台灣本島地區）。本公司提供退貨中心地址，供用戶寄回。
除台灣本島外，其他官方銷售地區運費須由購買者自行負擔，或提供最初銷售該產品之國家/地區內地址作為換貨使用。若您在保固服務所涵蓋的國家範圍內購買合錦科技產品（2.），本公司將為您提供國際保固服務。例如，原先於國家 “A” 購買本公司產品，後遷往國家 “B” 並尋求保固服務，若國家 “A” 和國家 “B” 都涵蓋在合錦科技保固服務範圍內，本公司將提供在國家 “B” 的保固服務；若國家 “B” 合錦科技保固服務地區，則需提供合錦科技保固服務國家/地區內地址作為換貨使用，否則，本公司將不提供保固服務（若您目前所在國家為海外官方銷售地區，請見該國家官網保固服務條款。請注意，完成保固服務所需時間、零件供貨狀況會因國家/地區而異。）
客戶同意本公司使用全新零件、產品、整新零件、配件（例如：牆壁插頭、燈具支架等），以完成保固範圍內之免費維修。經維修後之電子類產品（包括電子類本機及其因維修而更換之配件，或用戶依照合錦科技提供的說明書自行安裝的產品）之保固期限，為原產品保固期剩餘之天數或自維修完成後90天較短者。經更換後的零件或產品即成為客戶之資產，被更換後之零件或產品則為合錦科技之資產。
 
於退款作業時，請客戶將需要退款的產品寄回合錦科技。合錦科技確認收到完整需申請退款之商品後並安排退款後，此商品即成為本公司的資產。
 
排除條款與限制
本有限保固僅適用於由合錦科技製造或銷售之配件。客戶於申請保固服務時，需提供產品的購買證明（或可追溯的訂單號碼）。
非合錦科技的製造商及供應商，可能會向客戶提供各自的保固，而本公司僅按原樣提供其產品。本有限保固不適用於由合錦科技發布且帶有或不帶有 EZcaring 品牌名稱的軟體（包括但不限於系統軟體）。合錦科技不保證產品之運作絕對不會中斷或沒有錯誤。因未遵守產品使用指示而產生的損害，本公司一概不予負責。本保固不適用於：
(a) 因意外事故、濫用、誤用、水災、火災、地震或其他外部因素造成之損壞；
(b) 在合錦科技官方使用說明或預期用途之範圍外操作產品導致之損壞； 
(c) 由非合錦科技授權的第三方執行之服務（包括升級和擴充等）後導致之損壞；
(d) 未經合錦科技書面同意而進行改裝或變更功能的產品或零件；
(e) 消耗品和機械零件，但不包括材料或製造缺陷所造成的損壞； 
(f) 外觀損壞，包括但不限於刮痕和凹痕；
(g) 從非官方自有、授權或合作的網站或平台購買的產品。
合錦科技的有限保固服務僅適用於(13. g.)所列出之官方自有、授權或合作夥伴線上平台或實體通路購買之產品。
任何非從(13. g.)所列出之官方自有、授權或合作夥伴線上平台或實體通路購買的產品，將無法享有保固服務。使用保固服務時，需提供產品的購買證明（或可追溯的訂單號碼）。
除保固服務以外，我們不作任何其他之保證，亦不提供任何明示或默示之擔保（包括但不限於對適銷性、特定用途適用性的默示擔保、針對隱藏或潛在缺陷的擔保），以及任何個人、企業或公司就本產品提供的其他明示保證或擔保均不對合錦科技具有約束力。 
除非本保證另有明確規定，否則於法律允許的最大範圍內，合錦科技不對下列事項提供保固責任，包含損失、營業收入或利潤、儲蓄或其他收益之損失、機會損失、商譽損失、數據洩露或損壞、或因使用、誤用或無法使用本產品而造成的任何其他特殊、偶然或間接損害、或任何其他違反保證或條件的行為，不論索賠所依據的法律如何（即使合錦科技已被告知此類損害的可能性）。而對合錦科技任何形式的求償，不得高於產品的購買價格。客戶理解其應自行承擔因使用、誤用或無法使用合錦科技銷售的產品，而導致客戶及其財產和他人及其財產所造成的損失、損壞或傷害的所有風險和責任，上述損失均非因合錦科技的疏忽直接造成。 
本保固服務屬不可轉讓合約，說明客戶所屬權利資訊，僅適用於購買產品的原始客戶。 
 
如何獲得保固服務
合錦科技之產品於出貨前皆經過高規格的品質控管以確保產品功能運作正常。在未先與Ezcaring客服團隊聯絡並取得退貨授權編號前，請勿自行退回您的產品。如要取得保固服務，您需要將欲退回的產品以原包裝返還（或提供與原包裝保護程度相當的包裝），再按照客服團隊指示、將產品返還至合錦科技所提供的地址。本公司可能會在提供保固服務前，要求您提供官方或授權經銷商的購買證明和其他資料。 
您有責任備份儲存或保留在產品上的任何數據、軟體資訊或其他資料。在維修過程中，產品中的數據、軟體資訊或其他資料很可能會遺失或格式化，本公司對此類損壞或遺失概不負責。有關如何獲得保固服務的具體說明，請發送電子郵件至 support@hpbhitch.com 與我們聯絡。
 
有限保固期內的產品返還處理
合錦科技產品可以從(2)所列示之官方自有、授權或合作的網站或平台購買，並可根據收貨地區，獲得免費或付費的運送服務。為了讓本公司能夠提供售後保固服務，本公司會要求您返還有缺陷的產品以進行評估，確認是否需要修理或更換。
 
終止產品支援/終止產品使用
在產品保固期內, 合錦科技應提供技術問題的解決方案, 包含錯誤修正、發行一般功能維護的更新、替代方案或補救方法, 並盡其最大能力維護其產品的正常運行。產品保固期後, 本公司將提供技術問題的替代方案或補救方法, 並保留終止技術支援的權力及提供必要維修服務的權力。
在終止產品支援 (End of Support) 的「六個月」前, 合錦科技將透過官網公告, 提供終止產品支援 (End of Support) 後相關服務資訊。
在終止產品使用 (End of Life)的「六個月」前, 合錦科技將透過官網公告, 提供備份下載使用者資料或將資料轉移至其他合錦產品的方式。
 
聯絡方式
如果您對本有限保固或產品退貨有任何疑問，請發送電子郵件到 support@hpbhitech.com與EZcaring客服團隊聯絡。
''';

String privacy = '''隱私權及使用條款 Privacy Policy and Terms of Use
歡迎使用Ezcaring App（以下稱App），本網站由合錦科技股份有限公司經營，為了讓您能夠安心使用App的各項服務與資訊，特此向您說明App的隱私權保護即使用條款政策，以保障您的權益，請您詳閱下列內容：
一、隱私權保護政策的適用範圍
隱私權保護政策內容，包括App如何處理在您使用App服務時收集到的個人識別資料。隱私權保護政策不適用於本App以外的相關連結外部網頁，也不適用於非本App所委託或參與管理的人員。
二、個人資料的蒐集、處理及利用方式
App將向使用者（照護者或被照護者）蒐集被照護者所產生的生理資訊, 若您非被照護者本人，請確認您取得被照護者的同意。同時，App也會蒐集使用者所輸入的包含被照護者以及緊急聯絡人與照護者的以下個人識別資料。若您拒絕提供將無法提供您使用App相關服務：
當使用者登入使用App所提供之各項服務時，根據本App提供服務性質不同，我們會請您提供個人資訊，包括：帳號、密碼、電話、出生年月日、國籍、被照護者疾病史及其他相關必要、真實之資料。若已提供，表示您同意本App蒐集、處理、利用您所輸入之個人資料。
於一般連線時，伺服器會自行記錄相關行徑，包括您使用連線設備的IP位址、使用時間、使用的作ㄧ業系統、瀏覽及點選資料記錄等，做為我們增進App服務的參考依據，此記錄為內部應用，絕不對外公佈。
處理及使用範圍：在App所提供之功能服務時，於該特定目的範圍內處理及利用使用者的個人資料。
處理及使用方式：使用者個人資料蒐集與處理，將用於APP的會員管理檢索查詢等功能、資料統計外，也將利用於辨識個人身份、統計數據研究與公布、或宣傳廣告或行銷等，其相關利用方式如下：
為提供精確的服務，我們會將蒐集的資料內容進行統計與分析，分析結果之統計數據或說明文字呈現，除供內部研究外，我們會視需要公佈統計數據及說明文字，但不涉及特定個人之資料。 
針對民調、活動、留言版等意見，或其他服務事項，透過電子郵件、郵件、電話等聯繫您或提供各種服務資訊，或對於您透過電子郵件、郵件、傳真、電話等連絡方式提出詢問後進行回覆。 
其他前述業務附隨的事項。 
利用期間：至您要求停止使用或App停止提供服務之日為止。 
利用地區：除蒐集之目的涉及國際業務或活動外，本公司僅於中華民國領域內利用使用者的個人資料。 
不同意之權益影響：若使用者不同意提供個人資料，本公司將無法為使用者提供特定目的之相關服務。
除法律另有規定外，您對於個人資料的法定權利：
查詢或請求閱覽。 
請求製給複製本。
請求補充或更正。
請求停止蒐集、處理或利用。
請求刪除。
非經使用者書面同意，本App不會將個人資料用於其他用途。
未成年人使用App時，若同意本網站蒐集、處理、及利用其個人資訊時，應在法定代理人或監護人的同意下為之。法定代理人或監護人得隨時請求本公司停止特定帳號及其相關之個人資料之蒐集、處理及利用行為。但純獲法律上利益，或依其年齡及身份、日常生活所必需者，不在此限。
由於App無法知悉所蒐集到的個人資料是否屬未成年人所有，或是有無得到其法定代理人的同意。如果對本網站可能有未經法定代理人同意或未有其他法律依據而蒐集未成年人個人資料之疑慮，請以此E-Mail  連絡我們，我們將立刻採取妥善措施進行調查及改正。
三、資料之保護
本App主機均設有防火牆、防毒系統等相關的各項資訊安全設備及必要的安全防護措施，加以保護網站及您的個人資料採用嚴格的保護措施，只由經過授權的人員才能接觸您的個人資料，相關處理人員皆簽有保密合約，如有違反保密義務者，將會受到相關的法律處分。
如因業務需要有必要委託其他單位提供服務時，本App亦會嚴格要求其遵守保密義務，並且採取必要檢查程序以確定其將確實遵守。
四、網站對外的相關連結
本App的網頁提供其他網站的網路連結，您也可經由本App所提供的連結，點選進入其他網站。但該連結網站不適用本App的隱私權保護政策，您必須參考該連結網站中的隱私權保護政策。
五、與第三人共用個人資料之政策
使用者同意合錦科技股份有限公司合作之醫療保健機構暨其醫師、醫療人員得共享、傳輸、存取、蒐集、處理及利用您本人於本App上所填載之個人資料及分析數據資訊，作為研究目的之使用，除此之外，本App絕不會提供、交換、出租或出售任何您的個人資料給其他個人、團體、私人企業或公務機關，但有法律依據或合約義務者，不在此限。前項但書之情形包括不限於：
經由您書面同意。
法律明文規定。
為免除您生命、身體、自由或財產上之危險。
與公務機關或學術研究機構合作，基於公共利益為統計或學術研究而有必要，且資料經過提供者處理或蒐集著依其揭露方式無從識別特定之當事人。
當您在App裡的行為，違反服務條款或可能損害或妨礙App與其他使用者權益或導致任何人遭受損害時，經App管理單位研析揭露您的個人資料是為了辨識、聯絡或採取法律行動所必要者。 
您同意在本App服務範圍內，本App委託廠商得協助蒐集、處理或利用您的個人資料，受託廠商應盡善良管理人責任。
六、隱私權保護政策之修正
本App隱私權保護政策將因應需求隨時進行修正。
''';

String cookies = '''Cookies政策
1. 什麼是 Cookie？
Cookie 是一種小型文本文件，當你訪問我們的應用程序時，它會被存儲在你的設備上。Cookie 用於識別你的設備和瀏覽活動，並幫助我們提供更好的服務。
2. 我們使用的 Cookie 類型
我們的應用程序可能使用以下幾種類型的 Cookie：
必要 Cookie：這些 Cookie 是為了應用程序的基本功能而必須的。例如，用於保持用戶登錄狀態或記住你選擇的設置。
性能 Cookie：這些 Cookie 用於收集有關應用程序使用情況的信息，幫助我們改進應用程序的性能和用戶體驗。
功能 Cookie：這些 Cookie 允許應用程序記住你的選擇（例如，用戶名、語言或地區）以提供個性化的功能。
廣告 Cookie：這些 Cookie 用於顯示與你的興趣相關的廣告，並限制廣告的展示頻次。
3. 如何管理 Cookies
你可以通過你的瀏覽器設置管理或刪除 Cookie。具體操作方法取決於你所使用的瀏覽器。請參閱你的瀏覽器的幫助文檔以獲取更多信息。
Google Chrome： Chrome Cookie 設置指南
Mozilla Firefox： Firefox Cookie 設置指南
Safari： Safari Cookie 設置指南
請注意，如果你禁用或刪除 Cookie，某些功能或服務可能無法正常工作。
4. 第三方 Cookie
我們的應用程序可能會使用第三方 Cookie 來提供一些服務或功能（例如，社交媒體插件或分析工具）。這些第三方 Cookie 的使用受第三方的隱私政策和條款約束。
5. 變更 Cookie 政策
我們可能會不時更新這份 Cookie 政策。所有變更將在我們的應用程序內公佈並立即生效。請定期查看本政策以了解我們的最新 Cookie 使用情況。
''';
String about = '''About H.P.B. Hitech
HPB—Healthcare For Parents And Babies—以愛與關懷貫徹其品牌與識別。微笑般線條與P(parents)、B(babies)連成一張笑臉，象徵在我們的守護之下，父母與孩子都能享受安全生活、盡情展開笑顏。 用曲線將“P”與“B”連接起來，形成一張笑臉，象徵著父母和寶寶在我們的保護下可以享受的安全和幸福。HPB致力將數十年的光學電子研發專業知識與AI技術相結合，創建經過醫療專業人員測試的智慧醫療保健和家庭護理解決方案。我們目標是利用技術的力量為所有人提供更美好、更健康的生活。


Contact us 
TEL :886-425659188
E-MAIL : support@hpbhitch.com

''';
